Autodesk.Revit.DB.PointClouds.IPointCloudEngine.Free
Revit will call this method when done using the engine.
Since:
2012

Autodesk.Revit.DB.PointClouds.IPointCloudEngine.CreatePointCloudAccess(System.String)
Implement this method to construct the IPointCloudAccess interface for the point cloud designated by
the identifier.  This method is called once during the creation of a PointCloudType.
Remarks:
The instance of the returned IPointCloudAccess is then used by Revit to
display instances of the point cloud in Revit graphics and in the user interface.
identifier:
An identifier unique to the point cloud.  This will be a file name if the
engine was registered as file-based, or an arbitrary identifier if the engine is not file-based.
Returns:
The object that can be used to create iterators and interrogate the
point cloud for its features.
Since:
2012

Autodesk.Revit.DB.PointClouds.IPointCloudEngine
An interface that controls the behavior of the link from Revit to a custom Point Cloud Engine.
Remarks:
An instance of this interface should be created by the engine provider
and registered with the PointCloudEnginesRegistry. The engine may associated
with a particular file name extension during registration (for example,
Revit supplies a built-in engine for working with files with the extension "pcg").
Alternatively, the engine may be associated with an identifier which is not expected
to the be the extension of a particular file.
Since:
2012